# majors.py

MAJORS_BY_COLLEGE = {
    "문과대학": [
        "국어국문학과", "노어노문학과", "중어중문학과", "사학과", "영어영문학과",
        "철학과", "독어독문학과", "문헌정보학과", "불어불문학과", "심리학과"
    ],
    "상경대학": ["경제학부", "응용통계학과"],
    "경영대학": ["경영학과"],
    #"이과대학": [
        #"수학과", "지구시스템과학과", "물리학과", "천문우주학과", "화학과", "대기과학과"
    #],
    "공과대학": [
        "화공생명공학부", "사회환경시스템공학부", "전기전자공학부", "기계공학부",
        "건축학전공 (5년제)", "건축공학전공 (4년제)", # '건축공학과'에서 분리
        "신소재공학부", "산업공학과", "도시공학과", "시스템반도체공학과", "디스플레이융합공학과"
    ],
    "생명시스템대학": ["시스템생물학과", "생화학과", "생명공학과"],
    "인공지능융합대학": [
        "컴퓨터과학과", "인공지능학과", "인공지능시스템학과", # '첨단컴퓨팅학부'
        "IT융합공학전공", "지능형반도체전공", "모빌리티시스템전공" # '첨단융합공학부'
    ],
    "신과대학": ["신학과"],
    "사회과학대학": [
        "정치외교학과", "사회학과", "행정학과", "문화인류학과", "사회복지학과", "언론홍보영상학부"
    ],
    "음악대학": ["교회음악과", "성악과", "피아노과", "관현악과", "작곡과"],
    "생활과학대학": [
        "의류환경학과", "아동·가족학과", "식품영양학과", "통합디자인학과", "실내건축학과"
    ],
    "교육과학대학": ["교육학부", "체육교육학과", "스포츠응용산업학과"],
    "언더우드국제대학 (UIC)": [
        # Underwood Division (UD)
        "비교문학과문화(CLC)", "경제학(ECON)", "국제학(IS)", "정치외교학(PSIR)", "생명과학공학(LSBT)",
        # 융합인문사회과학부 (HASSD)
        "아시아학(AS)", "정보인터랙션디자인(IID)", "창의기술경영(CTM)", "문화디자인경영(CDM)",
        "계량위험관리(QRM)", "사회정의리더십(JCL)", "과학기술정책(STP)", "지속개발협력(SDC)",
        # 융합과학공학부 (ISED)
        "바이오융합(BC)", "에너지환경융합(EESE)", "나노과학공학(NSE)"
    ],
    "글로벌인재대학 (GLC)": [
        "국제통상전공", "문화·미디어전공", "한국언어문화교육전공", "바이오생활공학전공", "응용정보공학전공",
        "글로벌기초교육학부"
    ],
    "의과대학": ["의예과", "의학과"],
    "치과대학": ["치의예과", "치의학과"],
    "간호대학": ["간호학과"],
    "약학대학": ["약학과"]
}